{"title": "About the Boy Holding Up the World",
	"text":
	"
	His whole body hurts, but he can’t feel anything. His mind begs his limbs to move, but they don’t listen. His right ear is ringing and everything is muffled, but, in the chaos, he hears her: sobbing and shouting and screaming. He sees black, and in it: everything and nothing. \n
	“Nicholas, what happened in Berlin?” \n
    A newswoman invades his space and the camera flash blinds him. “Can you tell us what happened in Berlin?” \n
	“We won. We won, and that’s all that matters.”
	“Is Oliver, is he—is he really dead?”
	“I…” He hesitates. “Yes. Yes,  he’s no longer with us.”
	“What if it happens again? Are we safe from them alien bastards? Are you guys in any condition to fight them?”
	“Don’t worry, we’re working with The World Government, we have it under control.”
    “You guys aren’t invincible, who’s going to die next?”
	“No one. No one will die ever again.”
    “Is everything going to be okay?”
    “…”
    “Nicholas?”
	“Yes, because I’m going to make it okay.”

	“We welcome you back to this beautiful fall morning—just a week after the Berlin incident. We will not only go over the damage inflicted but—unfortunately—the casualties as—”
	Click. 
	“Now, with more information from analyzing the footage and interviewing witnesses, we conclude that Oliver’s death was caused by the negligence of his girlfr—”
	Click. The plump woman behind the counter turns the television off. 
	“They were going to say I killed him,” Miryan starts, eyes scrutinizing the television at the corner of the diner. “They were going to say I killed him.” She laughs. “That I fucking did.”
	Nicholas thinks he should say something., He wants to say something. He should say something, but no words come out. He looks at her, and his eyes are getting obnoxiously dry and they’re starting to sting a little, but he doesn’t want to—doesn’t dare— blink.
	“You guys don’t think I did it, right? Because it wasn’t me—it was—it was the—”
    As their leader, he notices—he notices a lot of things, so it doesn’t slip past him what she’s trying to do: ask for validation and reassurance for a chance at false closure. But instead of being honest and instead of lying to her, he raises his hand and reaches out for her.
	“Miry, stop,” Ambur interrupts her. “Can we just… not talk about it? Please?”
	His hand stops midair; it doesn’t know where to go or what exactly it should do. So for the longest time, it stands still in the air, until it ultimately returns to the surface of the table.
	It also doesn’t slip past him that it was Ambur’s first time speaking a word since they met up for brunch. 
	Miryan scoffs, “So you think I killed him?”
	“I said I don’t want to talk about it. Can we please not talk about it and move on?”
	“I can’t move on from my dead boyfriend.—You think I killed him, don’t you?”
	A pause. 
	As their leader, he should do something, anything. But he’s lost and confused and overwhelmed. So, so overwhelmed.
	“Yes!” Ambur stands up from his seat beside Nicholas. His voice is raised now and Nicholas’s vision starts to blur and his ears begin to hurt. “Yes.—you want me to be honest? You want me to talk about it? Yes, you fucking killed him, I-—I saw what happened…,  you were careless, distracted, and—”
	“You son of a—”
	“Stop,” He finally forces himself to speak and pulls his best friends out of their argument. “The both of you, please. Just stop.” He’s tired, there’s a stiffness in his shoulders, and breathing’s becoming too much work for him. But he still tries and tries to be okay for them. And honestly, it’s getting harder. 
	He takes a deep breath and does what he has to do: “Miry, you didn’t kill him, okay? And Ambur, she didn’t, no matter what happened back there—no matter what you saw—she didn’t kill him. Olie’s dead now, and it’s no one’s fault. It was just a tragic accident; —that’s all.” He lies.
	“Yeah, that’s all.” This time, he’s lying to himself.

	“What’s going on, Nicholas? I can tell something’s going on.”
	Nicholas looks up from his half-finished pasta and meets his girlfriend’s eyes. And with that look she gives him, he wants to—is about to—spill everything on his mind. He wants to tell her every thought he’s been thinking, everything he wants to do but can’t, all the expectations and obligations he’s been charged with—
	“Nothing,” he bites his tongue to stop himself from saying more. I’m drowning, and I don’t know how to save myself.  He swallows, “Everything’s fine, Callie.”
	“Please be honest with me.,” She’s stubborn. “Is everything okay? Are you okay?” She’s sharp.
	I’m not, but I say, “I am.”
	“Nick…” she’s disappointed—he can tell.
	He takes the next bite of his pasta and says nothing more.
	“Nicholas, I know—I know it’s been hard for you. But I think you should talk about it…, if not with me, then with someone else at least,” she starts. “I know opening up hurts, but it can help.—And what you need is on the other side of this feeling, Nicholas. And it can’t be fixed with the supernatural and superheroes and superpowers—just…” The pause in her voice voids everything she’s telling him. “Just with telling the truth.”
	“I’m here for you, Nicholas,” she reaches across the table for his hand. “I love you.”
    He knows she means it, but he also knows she doesn’t understand—and she never really will.
	He tries anyway, “Everything. It’s everything, Callie. So many things, so many things are going wrong—and I can’t—” he fails to stop the crack in his voice. “I can’t fix any of it.”
	“Nicholas, you’ve been so caught up with how the world feels about Olie’s death that… that I’m afraid you didn’t really come to terms with it yourself.” Only Callie. Only she can string her words together like that, and only she can be right when it comes to him.
    He realizes he can’t remember the last time he thought about Oliver’s death without the added task of comforting someone else—or what he really did to cope with it. Or if he ever tried. 
	Neither of them say anything anymore, but she stops eating her dinner and walks over to hug him. He lets her. 
    “It’s okay.” He lets her tire out the syllables of the mantra. 
	“You’ll be okay.” He lets her pretend to understand half of what he’s going through and pushes down the thought that it's her job, as his girlfriend, to say stuff like that. 
	
	“Nicholas!”
	He turns to the direction of the voice. 
	“Nicholas! Wait please.” A boy. A boy around his age, —younger maybe. When he sees that he stopped for him, he runs the last few steps. 
	“Hello,” he says, a little in awe and starstruck. “I’m wondering if Miryan, Ambur, and you can help me with something…” he stalls.
	Nicholas doesn’t say anything as he digs his hands deeper into his coat pockets and buries his face further into his scarf. He’s uncomfortable with where this conversation is going. He has a hunch, —and honestly—he doesn’t want to be right. 
	“I’m wondering if you guys c-can…” The boy chokes on his next words, and Nicholas notices—recognizes—that look on his face. 
    Anything, he prays. 
    “She’s… she’s been missing for a couple of weeks now. But I’m hoping you guys can find her.” 
    Anything but this.
    Nicholas’s eyes narrow and his heartbeat quickens., “Does this case have something to do with what happened three weeks ago?” His thoughts are running, and he’s working to bury the guilt.—
    “No. No, it doesn’t. The Berlin incident is unrelated to this case.”
    And he wants to punch himself for ever feeling relief at that. 
    Bring it to the police. We aren’t meant for cases like this. We’re so much more than missing persons and murder mysteries. His mind walks through all the things he wants to say.
    It’s been a month., Your sister’s probably dead.
    “I’ll—I’ll see what I—what we—can do for you,” he says without really meaning it.
    The boy thanks him and hands him a note with what must’ve been his scribbled number. Nicholas takes it and returns his smile, then bids him farewell. He watches the boy walk away; one, two, a dozen cars pass, but he’s still there, eyes tunneled to the spot where the boy once stood.  
    He crumbles the note in his hand, and his mind wonders when, exactly, did his identity become a chore. His conscience stops him from tossing it. 

	The next time he sees the both of them again after the funeral is at a meeting with important people. He should at least know said important peoples’ names, but making lasting first impressions lost its appeal a little while ago. To be honest, he’s starting to forget where he is and why he’s even here.
	“So, it’s been a month since the Berlin incident,” the wide man at the end of the long, rectangular wooden table starts. He looks up across at the three of them but Nicholas knows it's only at him, “Any progress on tracking the ones that are hiding among us?”
	He looks down at the notepad in front of him and answers, “No.”
	“Any progress at all?” the man’s moppy brows are raised now.
	“None, sir.”
    “Why, I’m a little disappointed in you, Nicholas.”
    “I understand, sir.,” He shifts in his seat. “And I apologize for our lack of progress., We’ll be better. I promise.”
	“It’s okay, boy,” the man replies with his fingers crossed. “I have great expectations—”
	“No, it’s not okay.”
	Everyone, including him, turns to the sound of the voice. His eyes meet its source.
	“The aliens are out there right now; , they’re out there doing god knows what, and these three haven't done a single damn thing.,” a complain. “ Heck, why are you even gifted with such powers if you’re going to be lazy and selfish? It would’ve been better off with anyone else,” an attack.
	He swallows the lump in his throat and keeps his eye contact with the woman. They’re in a room with at least two dozen others, all crowded into some old room of some old historically significant building, but it feels like they’re the only ones there. 
	“Fuck it, even I would’ve made better use of them.” An onslaught. 
	“Ms. Avery, please, they’re just kids—” the man at the center starts.
	A loud slam from his right and every head turns from the woman to her.
	“You want them?!” It's Miry’s turn now. “Cause I’d be better off without them too.”
    She’s laughing, and he knows it’s to keep herself from crying. But even if she does, he can’t blame her, because he kind of wants to, too. 
    “You think you can do our job?! Have at it! Take it, I’ll give you my powers if I can.” 
    “Miry, stop,” Ambur begs her. “Please. Not here, not now.”
    He turns to Nicholas for help, but like him, he doesn’t know how to. She’s charting into degeneracy, and he doesn’t know what to say or do to bring her back, so as her leader, he lets her continue:
    “Do you know what it’s like to live your life in paranoia? Afraid that the very same government officials you’re working with might one day turn on you—afraid of all the greedy corporations who had—have—wanted to experiment on you and your best friends?”
    His eyes burn, but he can’t pick anywhere to look. Ambur’s fighting for his attention—he’s trying to get him to stop her, but he’s caught on a thought: Does he even want to? 
    “Have you ever attended a stranger’s funeral? Seen a dead body? What about the blown-out brain or organs of someone? What about walking through them and stepping on them because you have no other choice?”
    His eyes find their way back to the notepad and it feels like he’s burning a hole in it. He sits there. He sits there and ignores all the pairs of eyes begging him to do something and he pretends he isn’t paying attention to any of them as he takes her all in. 
    He takes her all in and he lets her lay down all the ugly truths.
    “Do you know what it feels like to be burdened with the world’s fate? To devote yourself to its future…” she pauses. 
    “Miryan, stop… please.,” Ambur’s trying so damn hard. Nicholas can tell he’s getting restless; he looks like he’s about to throw up—and honestly, any more and he may have.
    And Nicholas gets it. He gets that now isn’t the time and that this isn’t the place, and he knows every goddamn world leader in this stuffy room is judging her and judging him for not stopping her—and even though no one really says anything, he can tell from the way they look at him.  
    “Only to question every day whether it’s even worth it. But you still have to… because that’s what heroes do. They save the fucking world.”
    Ah. And there it was. The truth he spent the entirety of his life denying, the truth he already knows anyway. The difference is, he can’t say it. As their leader and as the very best of them, he just can’t. 
    He isn’t allowed to. 
    Because admitting to it would betray the very definition of what a superhero is. 
    For the sake of the world, he can’t say no simply just because and just because he doesn’t really want to. For the sake of humanity, he pretends and lies and sells the fact that he’s okay and that everything is going to be okay. For the sake of his living friends, he isn’t allowed to mourn the one who’s dead. 
    He’s fed up—he always has been—ever since the aliens came and ever since they got lost in this mess and ever since he became afraid of mediocrity.  But still, as he closes his eyes and sinks further into his chair, mind empty, eyes watery, and heart numb, he reminds himself that—more than anyone else—he’s obligated to this. He knows that he’s a selfless fool, a prisoner to the world’s expectations, but he convinces himself that he’s okay with it.
    Because if not him, then who else?

    “It’s been three days now—since Nicholas from IV has been admitted to the hospital following his disruptive outburst at the World Government meeting. And with Oliver dead and Ambur and Miryan disappearing from the public eye, we are all wondering the same damn thing: will we be okay?”
"}
